{
  "name":"Creating a Compute Instance",
  "description": "Walkthrough on creating a Compute Instance.", 
  "steps": [
    {
      "message": "In this tutorial will go over steps on creating a compute instance. We will create a Linux VM, but you can change the image to any. <small><strong>Note:</strong> A VCN, and compartment must already be created.</small>",
      "path": ""
    },
    {
      "message": "Click the menu button on top left. Scroll down to <strong>\"Compute\"</strong> and click <strong>\"Instances\"</strong>. </br> {{img-url:/images/tutorials/computemenu.png}}",
      "path": "/compute/instances"
    },
    {
      "message": "Click Create Instance. Choose a name. For high availability there are 3 Availability Domains per *region. Under \"Operating System\" choose your image. For this tutorial we will choose the default Oracle Linux 7.<small><em>Tip:</em> Some regions only have one Availability Domain.</small>",
      "path": ""
    },
    {
      "message": "Choose Virtual Machines. To determine OCPU number and RAM GB size, OCI uses shapes for the different configurations of both. Choose any available or depending on workload. </br><small><em>Tip:</em> Bare Metal is required if you don't need virtualization.</br> Oracle CPU is equivalent to one physical core.</small>",
      "path": ""
    },
    {
      "message": "Add your public key in order to SSH into your instance. To learn how to create an SSH key pair on <a target='_blank' href='https://docs.cloud.oracle.com/iaas/Content/GSG/Tasks/creatingkeys.htm'>Mac/Linux</a> or <a target='_blank' href='https://www.cloudinsidr.com/content/how-to-create-openssh-keys-on-a-windows-desktop-for-remote-access-to-a-linux-server/'> Windows</a>.   </br>Under Networking choose the VCN you created before and the subnet. Skip Advanced Settings for now. </br></br> Click Create to create your first compute instance. </br><small><em>Tips:</em> For Mac/Linux you can easily copy your keys using \"pbcopy < ~/.ssh/id_rsa.pub\" command. </small>",
      "path": ""
    },
    {
      "message": "Click on create compute. </br> Congratulation, you created your first compute. For more information on computes go to the <a href='https://docs.cloud.oracle.com/iaas/Content/Compute/Concepts/computeoverview.htm' target='_blank'>documentation</a>",
      "path": ""
    }
  ]
}