{
    "name":"Creating an Oracle Database",
    "description": "Walkthrough on creating an Oracle Database.", 
    "steps": [ 
      {
        "message": "In this tutorial we'll show you how to create an Oracle Database on Oracle Cloud. The oracle database will have the same features as Oracle Database on premises with tools to make it easier to manage. </br> You don't need to do a fresh install when using database as a service. Also offers gives easy tool to backup and restore.<small><em>Note:</em> You need to have a VCN already created.</small>",
        "path": ""
      },
      {
        "message": "Click the menu button on top left. Scroll down to <strong>\"Database\"</strong> and click <strong>\"Bare Metal, VM, and Exatadata\"</strong>. </br> {{img-url:/images/tutorials/create_db1.png}}",
        "path": ""
      }, 
      {
        "message": "Click on <strong>\"Create DB button\"</strong> </br> Next you'll fill out information for the database. </br> Select the right compartment. Apply a name for your database that will be displayed on the console. <small><em>Note:</em> This is not the database name.</small> </br> {{img-url:/images/tutorials/create_db3.png}}",
        "path": ""
      },
      {
        "message": "Choose which Availability Domain to deploy. Next DBaaS offers different deployment options. </br> BareMetal deploys a standalone dedicated server. </br>Virtual Machine will deploy a database on a vm on shared server.</br> Exadata deploys database on Oracles engineered system optimized for Oracle DB. {{img-url:/images/tutorials/create_db3.png}}",
        "path": ""
      },
      {
        "message": "Choose your shape for OCPU and RAM count. Select which database edition you require for your workload.</br> Next input the amount of storage needed. If you require fast provisioning for testing purposes select Logical Volume Manager. Otherwise choose Oracle Managed Storage. <small><em>Tip:</em> More information on fast provisioning <a href='https://docs.cloud.oracle.com/iaas/Content/Database/Concepts/overview.htm#fastprovisioning' target='_blank'>here</a></br></small> {{img-url:/images/tutorials/create_db4.png}} {{img-url:/images/tutorials/create_db5.png}}",
        "path": ""
      },
      {
        "message": "Add your public key in order to SSH into your instance. To learn how to create an SSH key pair on <a target='_blank' href='https://docs.cloud.oracle.com/iaas/Content/GSG/Tasks/creatingkeys.htm'>Mac/Linux</a> or <a target='_blank' href='https://www.cloudinsidr.com/content/how-to-create-openssh-keys-on-a-windows-desktop-for-remote-access-to-a-linux-server/'> Windows</a>. </br> Choose the License type. Then choose the VCN and subnet to deploy it in. <small><em>Tips:</em> For Mac/Linux you can easily copy your keys using \"pbcopy < ~/.ssh/id_rsa.pub\" command. </small> {{img-url:/images/tutorials/create_db6.png}}{{img-url:/images/tutorials/create_db7.png}}",
        "path": ""
      },
      {
        "message": "Finally input the name for your oracle database itself. Choose the Oracle database version you wish to use.</br> Then for 12c and older versions will create a pluggable database. Apply a name for your PDB. </br> Give a password for your ADMIN user and click create! {{img-url:/images/tutorials/create_db8.png}} {{img-url:/images/tutorials/create_db9.png}}",
        "path": ""
      },
      {
        "message": "After clicking create your database should be provisioning. Congrats! You created an oracle database. For more information refere to the <a href='https://docs.cloud.oracle.com/iaas/Content/Database/Concepts/overview.htm' target='_blank'>documentation.</a> <a href='https://docs.cloud.oracle.com/iaas/Content/Database/Concepts/exaoverview.htm' target='_blank'>Exadata documentation.</a>",
        "path": ""
      }
    ]
  }
    