{
  "name":"User Credentials",
  "description": "Walkthrough on giving new users access to their account and the organization tenancy.",
  "steps": [
    {
      "message": "In order for new users to have access to the console they must have the temporary password for their first sign in. </br> In this tutorial we'll show how to give new user temporary password if their initial email was expired after 7 days. <small><em>Tip:</em> Can also be used to reset user passwords.</small>",
      "path": ""
    },
    {
      "message": "When the user signs in to the Console the first time, they'll be immediately prompted to change the password. If the user waits more than 7 days to initially sign in and change the password, it will expire and an administrator will need to create a new one-time password for the user. <small><em>Tip:</em> This only works for non-Federated users.</small>",
      "path": ""
    },
    {
      "message": "With the side menu open. Scroll down to <strong>\"Identity\"</strong> and click <strong>\"Users\"</strong>. </br> {{img-url:/images/tutorials/iduser.png}}",
      "path": ""
    },
    {
      "message": "Click the user you wish to change the temporary password or reset password. <strong>\"Click Create/Reset Password button\"</strong>. {{img-url:/images/tutorials/idpassword.png}}",
      "path": ""
    },
    {
      "message": "The popup menu will show the new temporary password. Click Create/Reset Password button is prompted. Safely give the password to the user.",
      "path": ""
    },
    {
      "message": "Now they are able to sign in and will be prompted to change the password. If in the future they need to reset the password, you can redo all these steps!",
      "path": ""
    },
    {
      "message": "Users who are not federated with IDCS have to sign in through the OCI console. Common OCI console url: <a href=\"https://console.us-phoenix-1.oraclecloud.com/\" target='_blank'>OCI console sign in page</a>",
      "path": ""
    }
  ]
}
